# ElementId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsComponentConnection..::..ElementId Property
StairsComponentConnection Class See Also
---
The element Id of connected stairs component in the stairs connection.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ElementId ElementId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ElementId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ElementId {
	ElementId^ get ();
}
```

# See Also
StairsComponentConnection Class
Autodesk.Revit.DB.Architecture Namespace